[
  {
    "Id": "1066314",
    "ThreadId": "449499",
    "Html": "Hello, <br />\nI have a question about the Search Results Razor macro. The instructions about the parameter &quot;summaryProperties&quot; say:<br />\n<blockquote>\n<pre><code>The list of properties, comma separated, in order of preference, that you wish to use to create the summary to appear under the title. All properties selected must be in the index, cos that's where we pull the data from. Defaults to Full Text\n</code></pre>\n\n</blockquote>\nSince I can't be sure there is a &quot;summary&quot; property that will be filled-in and visible on every page, I left this option blank, hoping that the &quot;Defaults to Full Text&quot; means that it will show some contextual snippet from the actual results (akin to Google, for instance), but at this point it is not displaying anything except the &quot;Read more...&quot; default text. <br />\n<br />\nAm I misunderstanding or otherwise missing something?<br />\n<br />\nThanks!<br />\nHeather<br />\n",
    "PostedDate": "2013-07-09T14:21:28.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1066475",
    "ThreadId": "449499",
    "Html": "Hi Heather\r<br />\n<br />\nIt does sound like your understanding of how it's suppose to work is correct. To clarify again:\r<br />\n<br />\nLeaving the &quot;summaryProperties&quot; macro parameter blank, should return the highlight from the field where the search term was found (e.g. Google). You should not need to do any further configurations for this...as long as the field is blank. If you do populate it with any fields, these fields must also be specified in the FullTextIndexSet as IndexUserFields.\r<br />\n<br />\nI have tested this and so far cannot reproduce the issue. The only times I do get the &quot;Read More...&quot; text, is when I've populated &quot;summaryProperties&quot; but for example haven't added those field into the index set.\r<br />\n<br />\nThis might be a long shot, but I have noticed that if you have a space for summaryProperties, it assumes you've specified a value. Can you please make sure that when you left it blank, that you have an empty string and not a space?\r<br />\n<br />\nAlso ensure that your index is up to date (you can use the FullTextSearch Developer tab to rebuild it) - although this specifically should not cause this issue. If this doesn't work, do you have any further info you can provide perhaps that would help reproducing the issue e.g. document types with searchable properties, their template snippets rendering these properties, FullTextSearch.config, FullTextSearch.cshtml, ExamineSettings.config snippet, ExamineIndex.confg snippet.\r<br />\n<br />\nRegards,\r<br />\nRigardt\r<br />\nGovernor Technology<br />\n",
    "PostedDate": "2013-07-10T02:28:50.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1067107",
    "ThreadId": "449499",
    "Html": "Thanks, Rigardt, \r<br />\n<br />\nAfter posting, I updated all the Examine settings to include all the possible properties worth indexing, and after some index kicking, it is now showing text for the summary. Now my problem seems to be that the nifty options you have built in to &quot;Full Text Search&quot; seem to be getting ignored.\r<br />\n<br />\nFor instance, I have added <br />\n<pre><code>@if (!Governor.Umbraco.FullTextSearch.Extensions.GeneralExtension.IsIndexingActive())\n{\n    ...macro output which shouldn't be included in search indexing such as nav menu, footer, etc...\n}</code></pre>\n\nto several macros, and I can see that the additional content is not getting rendered by viewing a page with &quot;?FullTextActive=1&quot; appended to the url, but the text is appearing in the search results summaries, for instance, the text of nav menus is the first thing visible.\r<br />\n<br />\nIn addition, even though I have several doctypes on the site which represent parts of content (like a sidebar blurb) and shouldn't be linked to directly, but indexed as part of the page that is pulling it in for display, and I have included them in &quot;&lt;NoFullTextNodeTypes&gt;&quot;, they are still appearing in the results as pages which can be linked to directly.\r<br />\n<br />\nIf I also add the same list of doctypes to the &quot;ExamineIndex.config&quot; &lt;ExcludeNodeTypes&gt; section of &lt;IndexSet SetName=&quot;FullTextIndexSet&quot; and re-index, the doctypes content is no longer there as an individual search result to its own &quot;page&quot;, but a search for sidebar content doesn't turn up the pages which include that sidebar content either, which it seems they should...\r<br />\n<br />\nPs. I have &lt;FullTextSearch&gt;    &lt;Enabled&gt;true&lt;/Enabled&gt;<br />\n",
    "PostedDate": "2013-07-11T09:03:10.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1072204",
    "ThreadId": "449499",
    "Html": "Hi Heather\r<br />\n<br />\nJust to make sure I understand correctly - the three issues mentioned above - were these also the case before you've updated the Examine settings to include all the possible properties worth indexing to get the summary text to show up? It sounds like they were fine at first but all started after the Examine settings update?\r<br />\n<br />\nThanks,\r<br />\nRigardt<br />\n",
    "PostedDate": "2013-07-24T03:51:46.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1072415",
    "ThreadId": "449499",
    "Html": "Hi Rigardt, \r<br />\n<br />\nWell, at first I wasn't get much in the results (the original query, above), and I made the config file updates (to both FullTextSearch and Examine) about the same time, so I can't pinpoint a cause.\r<br />\n<br />\nCurrent status of the isssues:\r<br />\n<br />\n<strong>1. IsIndexingActive() in macros should exclude rendered content from indexing</strong>\r<br />\nThis is working now. For instance, there is a main top nav menu with the word &quot;Community&quot; in it, but when I search for &quot;Community&quot; it only displays the 2 pages which include that word in the body text (and not every page on the website). YAY! \r<br />\n<br />\n<strong>2./3. &quot;Sidebar&quot; content should only be indexed as part of &quot;parent&quot; page.</strong>\r<br />\nI am currently getting mixed results for this. For example, I have a DocType called &quot;Blurb&quot;, which should never show up as a result in-and-of-itself (aka with a link to the Blurb node), but if the Blurb content is rendered on another page (for instance, on the sidebar of the FAQ page), and someone searches for that content, the &quot;parent&quot; page should be in the results (in this case, the FAQ page should be in the results). My tests have revealed the following: If I do a specific search for a phrase from the body property of the Blurb, it properly only returns the FAQ page, however, if I search for a word which is in the Node name of the Blurb, the Blurb itself (with a full url) is returned as a search result.\r<br />\n<br />\nMy FullTextSearch.config has this data:<br />\n<pre><code>&lt;NoFullTextNodeTypes&gt;\n        ...\n        &lt;add name=&quot;Blurb&quot;/&gt;\n    ...\n&lt;/NoFullTextNodeTypes&gt;</code></pre>\n\nMy ExamineIndex.config contains this:<br />\n<pre><code>  &lt;!-- Default Indexset for external searches, this indexes all fields on all types of nodes--&gt;\n  &lt;IndexSet SetName=&quot;ExternalIndexSet&quot; IndexPath=&quot;~/App_Data/TEMP/ExamineIndexes/External/&quot; /&gt;\n  &lt;IndexSet SetName=&quot;FullTextIndexSet&quot; IndexPath=&quot;~/App_Data/TEMP/ExamineIndexes/FullText/&quot;&gt;\n    &lt;IndexAttributeFields&gt;\n      &lt;add Name=&quot;id&quot; /&gt;\n      &lt;add Name=&quot;nodeName&quot; /&gt;\n      &lt;add Name=&quot;nodeTypeAlias&quot; /&gt;\n    &lt;/IndexAttributeFields&gt;\n    &lt;IndexUserFields&gt;\n    ...\n      &lt;add Name=&quot;BlurbContent&quot;/&gt;\n      &lt;add Name=&quot;BlurbLinkText&quot;/&gt;\n      &lt;add Name=&quot;BlurbShortDescription&quot;/&gt;\n      &lt;add Name=&quot;BlurbTitle&quot;/&gt;\n        ...\n    &lt;/IndexUserFields&gt;\n    &lt;IncludeNodeTypes /&gt;\n    &lt;ExcludeNodeTypes&gt;\n    ...{a bunch of DocTypes here, does not include a record to exclude &quot;Blurb&quot;}\n    &lt;/ExcludeNodeTypes&gt;\n  &lt;/IndexSet&gt;</code></pre>\n\nThanks for all you assistance.\r<br />\nHeather<br />\n",
    "PostedDate": "2013-07-24T10:40:58.453-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]