[
  {
    "Id": "1489731",
    "ThreadId": "660099",
    "Html": "Our installation of Umbraco is not at the root of our server. We have multiple sites on the same server and in each of them we have an Umbraco install. <br />\n<pre><code>\nhttp://ourserver/mysite/ root\nhttp://ourserver/mysite/umbraco backend\n\nhttp://ourserver/myOTHERsite/ root\nhttp://ourserver/myOTHERsite/umbraco backend</code></pre>\n\netc...<br />\n<br />\nWhen install full text search from Developer install local package, it installs into a new folder in the parent folder. <br />\n<br />\nThat is I expect a file <br />\nourserver/mysite/config/FullTextSearch.config <br />\nbut it installs into <br />\nourserver/mysite/mysite/config/FullTextSearch.config<br />\nnote:        ^^^^<br />\n<br />\nThe other files also install in that folder as well. <br />\nourserver/mysite/mysite/bin/Governor.Umbraco.FullTextSearch.dll<br />\nourserver/mysite/mysite/macroScripts/FullTextSearch.cshtml<br />\nourserver/mysite/mysite/macroScripts/FullTextSearch.cshtml<br />\nourserver/mysite/mysite/umbraco/plugins/FullTextSearch/Dashboard.ascx<br />\n<br />\nThe package was installed in Umbraco and in packages you could see full text search however the config file was not in the right place. <br />\n<br />\nI tried moving the files from the ~/mysite/mysite/ folder to the appropriate places in the correct folders so that it now looks like:<br />\n<br />\nourserver/mysite/bin/Governor.Umbraco.FullTextSearch.dll<br />\nourserver/mysite/macroScripts/FullTextSearch.cshtml<br />\nourserver/mysite/macroScripts/FullTextSearch.cshtml<br />\nourserver/mysite/umbraco/plugins/FullTextSearch/Dashboard.ascx<br />\n<br />\nI think this is the correct locations for everything. <br />\n<br />\nI have made the config modifications recommended in the documentation and now I get ASP errors. <br />\n<br />\nConfiguration Error<br />\n<br />\nDescription: An error occurred during the processing of a configuration file required to service this request. Please review the specific error details below and modify your configuration file appropriately. <br />\n<br />\nParser Error Message: Could not load file or assembly 'FullTextSearch' or one of its dependencies. The system cannot find the file specified.<br />\n<br />\nSource Error: <br />\n<br />\n<br />\nAn application error occurred on the server. The current custom error settings for this application prevent the details of the application error from being viewed remotely (for security reasons). It could, however, be viewed by browsers running on the local server machine.<br />\n<br />\nSource File: D:\\application\\apps\\ourserver\\mysite\\config\\ExamineSettings.config    Line: 25 <br />\n<br />\nAssembly Load Trace: The following information can be helpful to determine why the assembly 'FullTextSearch' could not be loaded.<br />\n<br />\nWRN: Assembly binding logging is turned OFF.<br />\nTo enable assembly bind failure logging, set the registry value [HKLM\\Software\\Microsoft\\Fusion!EnableLog] (DWORD) to 1.<br />\nNote: There is some performance penalty associated with assembly bind failure logging.<br />\nTo turn this feature off, remove the registry value [HKLM\\Software\\Microsoft\\Fusion!EnableLog].<br />\n<br />\nI would really like to get this set up. Does anyone have any ideas? <br />\n<br />\nMy next test is to open a sandbox server and install umbraco there and then full text search to see if it works when installed at the root of the server. <br />\n<br />\nemail is <a href=\"mailto:matt.brown@daimler.com\" rel=\"nofollow\">matt.brown@daimler.com</a> and I would be really happy to get some advice on setup. <br />\n",
    "PostedDate": "2016-12-12T13:31:51.673-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]